app/controllers/movies_controller.rb

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    id = params['id']
    @movie = Movie.find id

INSERT INTO "movies" ("title", "description", "release_date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
---
  def create
    @movie = Movie.new(movie_params)
    if @movie.save

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
 def edit
  id = params['id']
  @movie = Movie.find id

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "movies" SET "title" = ?, "description" = ?, "release_date" = ?, "updated_at" = ? WHERE "movies"."id" = ?  [["title", "Alladin 2"], ["description", ""], ["release_date", 1995-11-25 00:00:00 UTC], ["updated_at", 2017-01-26 23:27:00 UTC], ["id", 1]]
---
  def update
    id = params['id']
    @movie = Movie.find id
    @movie.update(movie_params)